package company.alibaba.exam20210527;

/**
 * @author Edwin Xu
 * @date 5/27/2021 11:50 PM.
 *
 * 小强现在有个物品,每个物品有两种属性和.他想要从中挑出尽可能多的物品满足以下条件:对于任意两个物品和,满足或者.问最多能挑出多少物品.
 *
 * 输入描述:
 * 第一行输入一个正整数.表示有组数据.
 * 对于每组数据,第一行输入一个正整数.表示物品个数.
 * 接下来两行,每行有个整数.
 * 第一行表示个节点的属性.
 * 第二行表示个节点的属性.
 *
 *
 * 输出描述:
 * 输出行,每一行对应每组数据的输出.
 *
 * 输入例子1:
 * 2
 * 3
 * 1 3 2
 * 0 2 3
 * 4
 * 1 5 4 2
 * 10 32 19 21
 *
 * 输出例子1:
 * 2
 * 3
 *
 *
 * 分析：
 * 一个二维坐标系
 * 
 */

public class Main01 {
    public static void main(String[] args) {

    }
}
