package leetcode.interview.offer;

import leetcode.util.Print;

/**
 * Created by Edwin Xu on 8/29/2020 9:20 PM
 * 剑指 Offer 15. 二进制中1的个数
 * 请实现一个函数，输入一个整数，输出该数二进制表示中 1 的个数。例如，把 9 表示成二进制是 1001，有 2 位是 1。因此，如果输入 9，则该函数输出 2。
 *
 * 示例 1：
 *
 * 输入：00000000000000000000000000001011
 * 输出：3
 * 解释：输入的二进制串 00000000000000000000000000001011 中，共有三位为 '1'。
 * 示例 2：
 *
 * 输入：00000000000000000000000010000000
 * 输出：1
 * 解释：输入的二进制串 00000000000000000000000010000000 中，共有一位为 '1'。
 * 示例 3：
 *
 * 输入：11111111111111111111111111111101
 * 输出：31
 * 解释：输入的二进制串 11111111111111111111111111111101 中，共有 31 位为 '1'。
 */
public class Offer_15 {
    public int hammingWeight(int n) {
        int c=0;
        for(int i=31;i>=0;i--){
            if(((n>>>i)&1)==1)c++;
        }
        return c;
    }

    /*
    *扩展：
    *o(n)求1-n中每个数的二进制表示中1的个数。。。dp做
    *
    *
    * 对每一个 i 都算一次，复杂度过高
    *
    *
    * */

    /*
    * 知道前一个的二进制1个数
    * 如何计算当前数字的二进制1个数
    *
    * 000101111  ---- 5个1
    * 加x=1之后：
    * 从后往前，用x去匹配，遇到一个1，res--,x=1继续，遇到0，res++,结束
    *
    * */
    public int hammingWeightFromOne2N(int n) {
//        int cur = 1;
//        int one = 1;
//        for (;cur<=n;cur++){
//
//        }

        return 0;

    }

}
