package leetcode.lc;

/**
 * Created by Edwin Xu on 8/30/2020 1:18 PM
 *
 * 85. 最大矩形
 * 给定一个仅包含 0 和 1 的二维二进制矩阵，找出只包含 1 的最大矩形，并返回其面积。
 *
 * 示例:
 *
 * 输入:
 * [
 *   ["1","0","1","0","0"],
 *   ["1","0","1","1","1"],
 *   ["1","1","1","1","1"],
 *   ["1","0","0","1","0"]
 * ]
 * 输出: 6
 */

public class LC_89 {
    //不用动态规划也行
    //对每一个位置，dfs走，走过标-1
    /*
    * 注意是矩形，
    *
    * 如何是找出最大的一堆‘1’，可以使用动态规划吗
    * 找出矩阵呢？？
    *
    * 有点难啊
    * */




    public static void main(String[] args) {
    }

}

/*
*
java知识补充：
一个类的构造器是不能调用该类其他的构造器

* */